Java/basic.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-08-14 Tue 15:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java Basic</title>
<meta name="generator" content="Org mode">
<meta name="author" content="某某人">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Java Basic</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbd0511f">1. == / equal</a></li>
<li><a href="#orgf880628">2. String/StringBuffer/StringBuilder</a></li>
</ul>
</div>
</nav>



<section id="outline-container-orgbd0511f" class="outline-2">
<h2 id="orgbd0511f"><span class="section-number-2">1</span> == / equal</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>==</code> 是一个关键词，用来判断左右两个元素是不是“同一个”:
</p>
<ul class="org-ul">
<li>对于基本类型，比如 int/float 等，会判断他们的值是不是相等</li>
<li>对于引用类型，比如 String/Object 等，会判断他们在内存（堆）中是不是同一片数据</li>
</ul>

<p>
<code>equals</code> 是一个方法，继承自 Object 类，主要用来判断两个<b>对象</b>是不是<b>相等</b>:
</p>
<ul class="org-ul">
<li>这个相等的概念可以定制。默认情况下，使用 <code>==</code> 比较</li>
<li>可以通过在自己的类中，覆写 <code>equals</code> 方法实现</li>
</ul>

<p>
比如，要比较两个字符串相等，正确的语法是:
</p>
<pre class="example">
str1.equals(str2)
</pre>

<p>
那是因为在 String 类中，对 <code>equals</code> 方法进行了如下定制，源码如下:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#20808;&#21028;&#26029;&#20004;&#20010;&#23383;&#31526;&#20018;&#26159;&#19981;&#26159;&#8220;&#21516;&#19968;&#20010;&#8221;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#20877;&#36880;&#19968;&#27604;&#36739;&#23383;&#31526;&#20018;&#30340;&#27599;&#20010;&#23383;&#31526;&#65292;&#26816;&#26597;&#20182;&#20204;&#26159;&#19981;&#26159;&#8220;&#30456;&#31561;&#8221;</span>
<span class="org-keyword">public</span> <span class="org-type">boolean</span> <span class="org-function-name">equals</span>(<span class="org-type">Object</span> <span class="org-variable-name">anObject</span>) {
    <span class="org-keyword">if</span> (<span class="org-keyword">this</span> == anObject) {
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    }
    <span class="org-keyword">if</span> (anObject <span class="org-keyword">instanceof</span> String) {
        <span class="org-type">String</span> <span class="org-variable-name">anotherString</span> = (<span class="org-type">String</span>)anObject;
        <span class="org-type">int</span> <span class="org-variable-name">n</span> = value.length;
        <span class="org-keyword">if</span> (n == anotherString.value.length) {
            <span class="org-type">char</span> <span class="org-variable-name">v1</span>[] = value;
            <span class="org-type">char</span> <span class="org-variable-name">v2</span>[] = anotherString.value;
            <span class="org-type">int</span> <span class="org-variable-name">i</span> = 0;
            <span class="org-keyword">while</span> (n-- != 0) {
                <span class="org-keyword">if</span> (v1[i] != v2[i])
                    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
                i++;
            }
            <span class="org-keyword">return</span> <span class="org-constant">true</span>;
        }
    }
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
}
</pre>
</div>

<p>
如果我们自己创建的类，也可以定制这种“相等”的规则:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Person</span> {
    <span class="org-keyword">private</span> <span class="org-type">String</span> <span class="org-variable-name">name</span>;
    <span class="org-keyword">private</span> <span class="org-type">String</span> <span class="org-variable-name">addr</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">getter/setter/constructor...</span>

    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">boolean</span> <span class="org-function-name">equals</span>(<span class="org-type">Object</span> <span class="org-variable-name">o</span>) {
        <span class="org-keyword">if</span>(o <span class="org-keyword">instanceof</span> Person) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#39318;&#20808;&#65292;&#35201;&#30830;&#20445;&#27604;&#36739;&#30340;&#23545;&#35937;&#26159;&#19968;&#20010; Person &#23545;&#35937;</span>
            <span class="org-keyword">if</span>(((<span class="org-type">Person</span>) o).getName().equals(<span class="org-keyword">this</span>.getName())) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#20854;&#27425;&#65292;&#25105;&#20204;&#35268;&#23450;&#22914;&#26524;&#20004;&#20010;&#23545;&#35937;&#21517;&#23383;&#30456;&#21516;&#23601;&#8220;&#30456;&#31561;&#8221;</span>
                <span class="org-keyword">return</span> <span class="org-constant">true</span>;
            }
        }
        <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(String.. args) {
        <span class="org-type">Person</span> <span class="org-variable-name">p1</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>(<span class="org-string">"tom"</span>, <span class="org-string">"&#29664;&#28023;"</span>);
        <span class="org-type">Person</span> <span class="org-variable-name">p2</span> = <span class="org-keyword">new</span> <span class="org-type">Person</span>(<span class="org-string">"tom"</span>, <span class="org-string">"&#19978;&#28023;"</span>);
        System.out.println(p1 == p2);       <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
        System.out.println(p1.equals(p2));  <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
    }
}
</pre>
</div>
</div>
</section>




<section id="outline-container-orgf880628" class="outline-2">
<h2 id="orgf880628"><span class="section-number-2">2</span> String/StringBuffer/StringBuilder</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>什么是字符串常量池？</li>
<li>为什么要有这种常量池？</li>
<li>String/StringBuffer/StringBuilder 有什么区别？</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 某某人</p>
<p class="date">Created: 2018-08-14 Tue 15:31</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
